[
  {
    "report": "Omnichannel",
    "brand": "Lowe's",
    "title": "Mobile Supercharges In-Store",
    "text": "There is a huge benefit to arming service staff with mobile devices. Number one is customer service: employees can get a better sense of customers’ previous purchases so as to better meet their current needs. A study among retailers shows positive associations between customer satisfaction (67 percent), upselling and cross-selling (63 percent), as well as employee morale (60 percent).<sup>1</sup><br><br>Lowe’s made the guided selling experience a point of focus for its business, equipping employees with a plethora of ways to meet customer needs through their mobile equipment. Beyond access to real-time store inventory levels, employees can also compile customer orders and arrange deliveries. If a customer needs an estimate on how much to buy, Lowe’s has estimation calculators.<br><br>Home improvement projects (and customer relationship building) is rarely a ‘single transaction’ issue. The strategy adopted by Lowe’s is a great way to ease customers into the omnichannel experience and gets them focused on mobile when coming into stores.",
    "footnote": "<sup>1</sup>Retail TouchPoints, “Optimizing The Store Experience to Build the Brand”, October 2016."
  },
  {
    "report": "Omnichannel",
    "brand": "Walmart",
    "title": "Complimentary App and In-Store Experience",
    "text": "Big box retailer Walmart exemplifies how a mobile device can integrate into  the in-store experience, rolling out a host of new app features in 2016 — support for price comparisons, in-store shopping, list building and various pickup options in store. Concurrent with these innovations, Walmart’s unique mobile visitors surged by 402 percent year-over-year, with 140 million mobile shoppers logging in per week in the US and 240 million globally. This helped online sales grow over 10 percent quarterly since March 2016.<sup>2</sup><br><br>Much of Walmart’s success on mobile is cemented in the physical world. Walmart’s Search My Store feature within the app (that provides turn-by-turn directions to specific items in a store) is driven by geo-fencing in all 4,300 of its stores.<br><br>Walmart’s encouraging push to build out a complementary mobile and in-store experience allows it to better compete with pure play retailers by driving initiatives such as an in-store pick up.",
    "footnote": "<sup>2</sup>“Target and Walmart have serious momentum going into the holidays,” Business Intelligence, Nov 18, 2016."
  },
  {
    "report": "Omnichannel",
    "brand": "Bloomingdale's",
    "title": "Mobile as the Connective Tissue",
    "text": "Personalization within the in-app and mobile web experience is essential to encourage usage. Retailers need to understand their shoppers and cater to how shoppers use (or expect to use) their mobile devices to interact with retailers.<br><br>Bloomingdales’ mobile web is an example of a clean integration centered around in-store services. The site is optimized for mobile, allowing it to deliver mobile specific features that align with the holistic shopping experience. Shoppers can select their preferred store through the mobile site and can browse upcoming events and information pertinent to specific stores.<br><br>The mobile site also caters to the mobile-centric lifestyle, allowing users to save selected in-store events to their calendars.<br><br>Bloomingdales epitomizes the omnichannel tenets that mobile should be connected and relevant to the physical store and digital offerings that retailers provide. Balancing mobile depends largely on whether a brand’s customers expect parallel or slightly differed experiences across channels.",
    "footnote": ""
  },
  {
    "report": "Omnichannel",
    "brand": "Macy's",
    "title": "Transparent Site and In-Store Inventory",
    "text": "Macy’s real time in-store inventory feature allows customers to check the availability of a desired product with just one click through an in-page popup, without navigating away from the PDP. The PDP provides fulfillment options, while the shopping bag price includes shipping costs if that option is selected. The shopping bag page also features a Free Shipping Threshold countdown to encourage larger carts.<br><br>Macy’s separates itself from the pack through the sheer number of available products for in-store pick up as well as its ability to draw on store inventories nationwide to fill online orders. These capabilities stem from being a first mover in the real-time inventory and click-and-collect spaces in 2013. Despite closing stores at a rapid clip, the brand’s net sales have remained relatively unchanged over the last three years, reflecting the success of their e-commerce and omnichannel focus.",
    "footnote": ""
  },
  {
    "report": "Localization",
    "brand": "Forever 21",
    "title": "E-Commerce Across Channels & Countries",
    "text": "Forever 21 uses templates to maintain a consistent look and feel throughout its nine country-specific e-commerce sites. The homepage, grid page, and PDPs have a consistent display format. The PDP features the same number of product images presented in the same configuration on each country site, while information on sizing is localized. Despite using templates, Forever 21 still caters to local markets by algorithmically updating the “Best Seller” grid page with local best sellers, translating site content (including navigation and buttons), and providing product measurements in local units.<br><br>Forever 21 is able to achieve this local scale with just over 20 people on its global team. More than half are located in their Los Angeles headquarters, with the rest of the team distributed in the local markets. This proves that localization and testing new markets does not have to be prohibitively expensive or resource heavy.",
    "footnote": ""
  },
  {
    "report": "Localization",
    "brand": "Apple",
    "title": "Where Art Thou Located, Video Viewer?",
    "text": "Apple has a rich history of masterful video content and a flair for the dramatic. Their events draw large crowds of fans and journalists (both in person and online) and their local in-market strategy leverages equally robust video content.<br><br>The Apple website detects the user’s country of origin, and automatically redirects to the appropriate regional website. From there, the user is directed to local product and content pages with highly localized video content. In Japan, kanji characters are clearly seen on iPhone screens, in China, a couple is filmed on an iconic Shanghai street, and in Spain, a featured video shows a man diving into a pool as a trumpet solo by Arturo Sandoval, a Cuban jazz artist, plays in the background.<sup>3</sup> Apple also deploys this content across various local and global platforms, including, YouTube, Facebook, Instagram, Youku Todou, and WeChat, increasing the visibility and impact of its high-quality video investments.",
    "footnote": "<sup>3</sup>“Apple iPhone 7 TV Commercial, ‘Dive’ Song by Arturo Sandoval,” iSpot.tv, 2016."
  },
  {
    "report": "Localization",
    "brand": "Nike",
    "title": "Speaking the Same Language",
    "text": "When it comes to localizing, regional customer service is important despite its cost. Providing multiple ways to get in touch with the company builds trust and alleviates purchase anxiety, as it demonstrates the brand’s commitment to its products.<br><br>Nike France provides several local customer service options. They offer local support via both email and phone, using a +33 number rather than a toll-free international pre x, which creates a more local feel. During regular working hours, customers can also choose to contact a Nike representative through live chat, which is useful for time-sensitive orders. Nike completes the omnichannel customer experience by including a store locator on the customer service page.",
    "footnote": ""
  },
  {
    "report": "Localization",
    "brand": "adidas",
    "title": "Adopt a Local Payment Option",
    "text": "Digital payments are another area in which brands consistently underperform. Customer-preferred payment options vary among regional markets, and brands must be responsive to local market trends when determining which payment services to offer. Despite the demonstrated need for flexibility in this area, many brands only allow customers to pay with American Express, MasterCard, or Visa.<br><br>Adidas provides a wide variety of payment options through both international and domestic credit card networks, allowing the brand to cater to both domestic and international shoppers. The brand also allows shoppers to use Boleto Bancario, a service that enables payment via cash deposit.",
    "footnote": ""
  },
  {
    "report": "Content & Commerce",
    "brand": "Nordstrom",
    "title": "Tying it All Together",
    "text": "On its homepage, Nordstrom includes carefully curated promotional and product information based on the user’s previous browsing behavior. The grid pages include robust filters based on product category to help consumers quickly find products while browsing, allowing them to compare products side by side. For example, jeans can be filtered by style, rise, wash, color, price, brand, and size. Hovering over product images on the grid page triggers additional product photos and link to video, a feature present on only four percent of brands.<br><br>Nordstrom product pages provide a similarly informative content experience with product reviews, images, videos, recommended items to complement the look, and personalized recommendations based on site browsing behavior.<br><br>While Nordstrom seamlessly integrates site content to drive shoppers down the funnel, checkout and buying processes are standard and in-line with other brands studied.",
    "footnote": ""
  },
  {
    "report": "Content & Commerce",
    "brand": "Guess",
    "title": "No Inventory Lasts Forever",
    "text": "Retailer Guess’ abandoned cart emails link directly to the recipient’s shopping cart,  displaying the original item and including a \"Complete Order\" button that leads to the user’s checkout cart.<br><br>The brand goes beyond basic tactics by sending a series of emails urging the shopper to complete their purchase due to the item’s limited stock. For example, a second abandoned cart email is titled “SOLD OUT” and says in the body text, “They’re in your bag, but not ‘on hold.’ Get them before someone else does.” A third email informs shoppers that they have one final chance to secure the item before their shopping bag refreshes.<br><br>This creates a sense of urgency to the purchase and motivates shoppers to complete their order before the item is sold out or their shopping cart is reset. Additionally, the brand advertises free shipping for orders above $99 at the top of the email body, giving shoppers even more reason to buy.",
    "footnote": ""
  },
  {
    "report": "Content & Commerce",
    "brand": "Neiman Marcus",
    "title": "Winning Guided Selling",
    "text": "Neiman Marcus’s mobile app is best in class, marrying rich content with streamlined commerce. The app’s “Flip to Find” feature creates a queue of products, allowing users to swipe right to favorite an item and swipe left to move to the next item in the stack. This feature innovatively engages consumers and guides them towards a sale. The brand also offers a “Snap.Find.Shop” that allows users to photograph items from their wardrobe and uses image recognition software to recommend similar products. Consumers can also call, text, or FaceTime store associates to ask any questions they may have, removing friction from the buying process.<br><br>Finally, Neiman Marcus offers four different expedited payment options, which are particularly important on mobile given how difficult it can be to enter credit card information on a small screen. Despite this, less than half of commerce-enabled apps provide any expedited payment options.",
    "footnote": ""
  },
  {
    "report": "Content & Commerce",
    "brand": "Nike",
    "title": "Getting Chatty",
    "text": "Only six percent of brands had an active chatbot in March 2017. Early adopters of chatbots provide highly differentiated experiences for their consumers, with content recommendations and appointment booking services. Chatbots can also reduce friction and help to facilitate purchases, allowing users to store payment information on Facebook to make one-click purchases.<br><br>Seven in ten US millennials report that they are interested in using chatbots to interact with brands,<sup>4</sup> and brands should consider adopting this technology to reach this high-spending and digitally-minded generation of consumers.",
    "footnote": "<sup>4</sup>“SURVEY: Nearly 60% of Millennials Used Chatbots,” Retail, February 21, 2017."
  },
  {
    "report": "Content & Commerce",
    "brand": "Michael Kors",
    "title": "Shop the Look",
    "text": "Michael Kors successfully integrates lookbooks into its PDPs for seamless viewing. The fashion retailer has reaped several benefits from investing in such content, including boosts in average visit duration. Overall, lookbooks curate shoppable looks from a selection of products based on trends and stylist recommendations, helping shoppers see items in the context of a full outfit and potentially resulting in multiple purchases.<br><br>Despite their ability to promote cross- selling, influence purchases, and improve site traffic, only half of Activewear, Department Store, Fashion, and Specialty Retail brands integrate lookbooks on site. In addition, brands using lookbooks often neglect to make them easy to find. Only 16 percent and 14 percent of analyzed brands in L2’s Intelligence Report: Content & Commerce 2017 showcase lookbooks on the homepage and grid pages, respectively. Two-thirds of these brands fail to link this content directly to product pages.",
    "footnote": ""
  },
  {
    "report": "Loyalty",
    "brand": "New Balance",
    "title": "Make it Enticing",
    "text": "New Balance maintains loyalty visibility across its digital platforms, promoting myNB Rewards on the site header and advertising potential loyalty points at checkout. The brand also promotes its loyalty program by strategically leveraging its partnerships. The brand uses email and its mobile app to promote its partnerships with fitness apps Strava and RunIQ, appealing to the interests of its athletically-minded consumers.<br><br>The MyNB Rewards program also sets itself apart by taking advantage of non-transactional incentives. Rewards members can earn points by interacting with New Balance on social media, going to the store, and tracking their fitness. Presenting opportunities for non-transactional engagement encourages consumer loyalty.",
    "footnote": ""
  },
  {
    "report": "Loyalty",
    "brand": "Sephora",
    "title": "Top-Tier Program",
    "text": "Sephora’s Beauty Insider loyalty program has three tiers: Beauty Insider, VIB, and VIB Rouge, each offering incremental rewards based on spend. The jump from Beauty Insider to VIB Rouge is significant, as top-tier members have a multitude of perks like a private hotline, exclusive event access, and unlimited free makeovers. Furthermore, while all Beauty Insiders receive free samples with online orders, sample options differ based on tier. The lowest-tiered members have access to samples from lower-priced brands like Clinique, while VIB Rouge members enjoy samples from luxury brands like Guerlain.<br><br>Sephora’s most loyal consumers—those with VIB Rouge Status— have become advocates for the brand. The #VIBRouge hashtag has been used in over 67,000 Instagram posts, as users actively celebrate when they have reached this status milestone and post on Instagram and Twitter about the special benefits they receive.",
    "footnote": ""
  },
  {
    "report": "Loyalty",
    "brand": "Walgreens",
    "title": "Best-In-Class Email",
    "text": "Walgreens’ best-in-class email strategy motivates Balance Rewards member signups and drives current member engagement.After account creation, a welcome email summarizes membership benefits for the Balance Rewards program and prompts users to join.<br><br>Once a consumer enrolls, the welcome email clearly outlines reward opportunities and explains the points system. The bottom of subsequent loyalty emails includes a snapshot of the user’s account information, including the overall points balance and number of points remaining until the next reward, and personalizes the subject line with the user’s name. Walgreens also promotes cross-channel integration of its program by sending coupons that are easily “clippable” to the user’s account and can be accessed in store, on site, and on the app.<br><br>Walgreens’ best-in-class mobile app effectively integrates its Balance Rewards loyalty program. Members can access a mobile version of their loyalty card within the app, and upon scanning at the register, any applicable clipped coupons are automatically applied to the customer’s purchases, a major convenience for members.",
    "footnote": ""
  },
  {
    "report": "Loyalty",
    "brand": "Overstock.com",
    "title": "Appealing Apps",
    "text": "Overstock.com’s Club O program is integrated in the brand’s highly interactive mobile app. Users can access program benefits, current status, and program reviews from the loyalty tab of the app. The app’s Flash Deals feature creates a queue of discounted products, allowing users to swipe right to add items directly to the cart and swipe left to move to the next item in the stack. The brand also employs a “Lott-O” feature, where users can uncover rewards on a virtual lottery scratch card to unveil special rewards. These features innovatively engage consumers and guide them towards a sale, and while every app user has access to these tools, the discounts are bigger for Club O members. ",
    "footnote": ""
  },
  {
    "report": "Mobile",
    "brand": "Best Buy",
    "title": "The Golden Standard",
    "text": "Best Buy provides a best-in-class reference for brands using mobile to guide in-store pickup and selling. The retailer prompts users to enable location services and automatically geolocates the nearest store, but still allows users to manually input a different store. Once the store has been selected, PDPs update to reflect the projected fulfillment times for each item. Best Buy also offers in-store pickup, and items are ready within an hour.<br><br>Best Buy’s store locator provides a wealth of store-specific information beyond addresses, contact numbers, and hours,including each store’s unique weekly offers and special services.<br><br>Effectively leveraging mobile as part of its omnichannel strategy has helped Best Buy outpace Amazon in year-over-year online sales growth since 2015.<sup>5</sup> Even same store sales, a metric by which other retailers have been doing poorly, have risen at Best Buy in Q2 2017, prompting the brand to raise its full year revenue growth forecast from 2.5 to 4 percent.<sup>6</sup>",
    "footnote": "<sup>5</sup>“Best Buy says strong sales not ‘new normal,’ shares skids,” Reuters, August 29, 2017.</br><sup>6</sup>“Why I Was Wrong About Best Buy,” Motley Fool, June 5, 2016."
  },
  {
    "report": "Mobile",
    "brand": "American Eagle Outfitters",
    "title": "Same but Different",
    "text": "American Eagle Outfitters is one of the few brands with an app that offers users a better value proposition than its mobile site. The app features a photo scanner that allows users to search for clothes by taking picture of a similar piece of clothing. The scanner can identify gender, color, and clothing category, and feeds them into the search function within the app to deliver similar results. The app also serves as a barcode scanner, allowing the user to scan items in a physical store and have them delivered rather than wait in the checkout line.<br><br>The app also incorporates American Eagle’s loyalty program and provides a digital version of the loyalty card, which can be integrated with Apple Wallet for additional convenience. The app provides the same Reserve Online, Pickup in Store feature that its mobile site offers, equipping app users with full mobile functionality.",
    "footnote": ""
  },
  {
    "report": "Mobile",
    "brand": "Kohl's",
    "title": "Connecting Email to App and Store",
    "text": "Kohl’s applies a mobile-first strategy to its emails, targeting its app users and integrating social media links and mobile capabilities like shop-by-store.The brand sends daily deals and incorporates omnichannel features to reduce the friction of redeeming the offer. Kohl’s allows customers to add discounts directly to their Kohl’s Wallet within its app. Customers without the app can scan the barcode provided in the email body.<br><br>In addition to providing multiple redemption options, Kohl’s links to grid pages on its mobile-optimized site for product categories highlighted in emails. Selecting an image of bedding products leads to an appropriate bedding grid page on the site, which includes the brand’s Shop My Store inventory lookup. If a user has already set their store, the site uses cookies to auto-load their indicated preference.<br><br>By linking meaningfully to all of its mobile properties, Kohl’s not only improves the user experience, but also helps drive its omnichannel efforts to connect digital and in-store shopping.<sup>7</sup>",
    "footnote": "<sup>7</sup>L2 analysis of eDataSource data."
  },
  {
    "report": "Mobile",
    "brand": "Aveda",
    "title": "Cover All Your Bases",
    "text": "Aveda maximizes the value of paid search real estate on Google. In addition to incorporating click-to-call on its AdWords result, the brand integrates four links spanning a broad range of subjects. The first link targets first-time customers with a “15% Off Your First Order” call-out that links to the brand’s mobile site. Here, Aveda greets customers with a hero image of sample products, three of which can be included in the order for free.<br><br>The second link supports omnichannel behavior by linking to the site’s store locator page. The third link targets potential customers by pitching Aveda Points-based Pure Privilege Rewards program. This leads to a rewards homepage that advertises program benefits and promotes Aveda Loyalty-focused app. For casual browsers, Aveda includes a link to its hairstyle tutorial page, which includes a filter at the top that allows users to search by style. This helps advance Aveda’s product discovery strategy and gives users a preview of products.",
    "footnote": ""
  },
  {
    "report": "Data & Targeting",
    "brand": "Urban Decay",
    "title": "Features with Purpose",
    "text": "Urban Decay has adopted a sophisticated data strategy organized around a marquee product, Vice Lipstick. The brand’s efforts enable it to micro-segment its customers and develop a granular understanding of product and style preferences.<br><br>The brand launched a My Top Vices feature on its site to coincide with the release of the Vice Lipstick line. Customers can interact with these shades virtually by uploading a selfie and exploring different lipstick colors superimposed on an image of themselves. Urban Decay incentivizes participation by awarding five points to users who share a virtual try-on via social media or email.<br><br>This serves as a touchpoint for data capture, and enables Urban Decay to market specific product styles and shades to its customers downstream if needed. Indeed, returning to the site homepage reveals a carousel of recommended products, including Vice Lipstick in different shades.",
    "footnote": ""
  },
  {
    "report": "Data & Targeting",
    "brand": "bareMinerals",
    "title": "Limitless Personalization",
    "text": "bareMinerals successfully uses the data it collects through its Beauty Profile to personalize recommendations for customers. The system allows customers to build a profile based on product-specific needs such as skin type, as well concern areas such as dark circles. Once customers save their beauty profile inputs, bareMinerals proceeds to update the recommendations that surface on the customer’s account page to reflect their specific areas of concern and interest.<br><br>The near real-time product personalization approach gives the customer the confidence and an incentive to offer more information about their preferences in the Fab Questionnaire follow-up. In the questionnaire, bareMinerals collects information about the customer’s preferred sales channels, their makeup preferences, favorite products, and so on. This data, combined with the data collected in the creation of the beauty profile allows for the creation of over 100 million unique  bareMinerals customer profiles, such that the brand can micro target on site and push bespoke marketing across the web.",
    "footnote": ""
  },
  {
    "report": "Data & Targeting",
    "brand": "The North Face",
    "title": "Hard to Connect",
    "text": "The North Face launched its VIPeak Program in 2012 to enhance customer engagement with the help of  third-party developer TIBCO. The best-in-class loyalty program engages customers with diverse monetary and experiential rewards, providing points for visiting stores, providing customer data, and purchasing products. By combining VIPeak data with analytics from TIBCO, the brand can optimize marketing spend and target consumers based on interest.<br><br>This is especially apparent in the brand’s email campaigns, which feature VIPeak program status personalized email headers, indicating an effective CRM integration. However, when L2 attempted to trigger display retargeting across the open web, we achieved mixed results, and found no creatives tied to VIPeak.<br><br>When browsing incognito, the brand’s retargeting vendors MediaMath and One by AOL served ads on a variety of sites. The North Face could limit repetitive ad buys by adding ad load limits to programmatic buy terms and employing third-party verification services to keep the quality of sites high.",
    "footnote": ""
  },
  {
    "report": "Data & Targeting",
    "brand": "Bloomingdale's",
    "title": "Hitting All Targets",
    "text": "Bloomingdale’s constantly communicates with its shoppers. From October 2016–2017, the department store sent 1,720 campaigns to consumers, excluding auto generated order confirmations, shipping updates, and account notifications. Of those, 50 were targeted (2.9 percent of total), which works out approximately to one targeted campaign per week. This was slightly ahead of Nordstrom at 2.2 percent, but far behind sister brand Macy’s at 6 percent and category competitors Bergdorf Goodman at 8.6 percent and Saks Fifth Avenue at 13.1 percent.<br><br>Bloomingdale’s email campaigns rely on three key elements: careful content curation by collection, remarketing including targeted emails, and engagement of loyalty program members. The retailer operates two main email domains, one for general emails and one for its loyalty members. The brand’s loyalty domain enjoys a higher open rate than the generic domain.",
    "footnote": ""
  }
]